{
  "posts": [
    {
      "slug": "k-content-ip-sovereignty-2025",
      "title": "K-Content IP Sovereignty: The Crisis of Revenue Models and the Path to Industrial Restructuring",
      "excerpt": "Presented a discussant paper at the National Assembly forum on K-Content IP sovereignty held on November 11, 2025, analyzing the structural challenges facing Korea's content industry through the lens of business economics.",
      "date": "2025-11-11",
      "category": "Analysis",
      "tags": ["K-Content", "IP Rights", "Media Economics", "OTT", "Global Value Chain", "Industrial Policy", "Media Financing", "Netflix", "Content Industry"],
      "image": "/images/blog/photo1.jpg",
      "author": "Yonghee Kim",
      "enableShare": true,
      "content": "<p>On November 11th, 2025, I participated as a discussant at the National Assembly forum titled 'Policy Directions for Securing K-Content IP Sovereignty and Revitalizing the Domestic Industry,' hosted by the National Assembly's Media & Communications Forum.</p><img src='/images/blog/photo1.jpg' alt='Forum Program' style='width:100%; margin:2rem 0; border-radius:0.5rem;' /><h2>The Real Crisis: Not Production Capability, But Revenue Models</h2><p>Professor Lee Seong-min's presentation accurately diagnosed the structural problems facing the K-content industry. I fully agree with the core argument that this is 'a crisis of revenue models, not production capability.' In my discussion, I applied a business economics framework to deepen the analysis, focusing particularly on the gap between IP ownership and IP utilization.</p><h2>1. The Essence of the Crisis: Collapse of Derived Demand and Monopsony Market Structure</h2><p>The broadcasting industry data is always shocking. In 2024, revenue declined by 0.9% in reverse growth, and operating profit plummeted by 26.7%. More seriously, advertising revenue decreased from 2.7 trillion won in 2020 to 2.3 trillion won in 2024 - a loss of 420 billion won. This represents a structural collapse of derived demand for content.</p><p>The domestic OTT situation reveals another dimension. OTT usage reached 89.3% in 2024, indicating market saturation, while average monthly spending on paid OTT actually decreased from 12,005 won to 10,500 won.</p><h2>2. IP's Real Options Value and the Utilization Gap</h2><p>Content IP isn't merely an asset but a right to create uncertain future value streams at present. The Squid Game case perfectly demonstrates this. Netflix systematically realizes option time value and volatility premium.</p><p>An important misconception must be corrected. Currently, only about 15% of global OTT deals involve complete IP abandonment. The remaining 85% already involve shared IP investment and revenue distribution. So what's the problem? Not IP ownership itself, but inability to utilize secured IP.</p><h2>3. The Real Crisis: Volume Decrease and Ecosystem Collapse</h2><p>Production dropped from 141 titles in 2022 to 107 in 2024. As global OTTs shift to efficiency phases, they invest only in verified projects, raising entry barriers.</p><h2>4. Global Value Chain and Industrial Restructuring</h2><p>The Korean content industry has now fully integrated into the global value chain. This is an irreversible structural change. Our current positioning: Korea has world-class competitiveness in planning and production, but substantial funding, most global distribution and marketing, and actual execution of secondary utilization are primarily led by global platforms.</p><h2>5. Policy Roles: Building IP Utilization Ecosystems</h2><p><strong>First, foster Korean-style production committees.</strong> Like the Demon Slayer model, strategies proving success based on strong domestic markets before global expansion are needed.</p><p><strong>Second, establish K-IP Commercialization Agency.</strong> This agency should integrate existing programs while focusing on actual matching with global brands.</p><p><strong>Third, strengthen domestic ecosystem self-sustainability.</strong> Securing domestic demand is negotiation power's core.</p><p><strong>Fourth, consider selective financial support as initial catalyst.</strong> The K-IP Utilization Fund can serve as initial catalyst.</p><h2>Conclusion</h2><p>The goal is not to exclude global OTTs but to equip domestic platforms with negotiation power. Just as Demon Slayer first proved success in the Japanese market and leveraged that negotiation power to contract with Netflix on favorable terms, Korea should also create a structure where it first proves success through strong domestic platforms in the first window, then cooperates with global OTTs as equal partners.</p>"
    },
    {
      "slug": "kabts-conference-2025",
      "title": "KABTS Conference Presentation: Media Financing, Digital Inequality, and the Future of OTT Markets",
      "excerpt": "Presented three research studies on sustainable media ecosystem financing, Korea-US OTT switching behavior, and digital inequality in media usage at the 2025 KABTS Fall Conference.",
      "date": "2025-11-08",
      "category": "Research",
      "tags": ["Media Policy", "Conference", "KABTS", "Digital Inequality", "Media Financing", "OTT", "Public Broadcasting", "Consumer Behavior", "Digital Transformation"],
      "image": "/images/blog/conf1.jpg",
      "author": "Yonghee Kim",
      "enableShare": true,
      "content": "<p>On November 8th, I had the privilege of participating in the Korean Association for Broadcasting & Telecommunication Studies (KABTS) Fall Conference, where I presented three research studies addressing critical issues facing Korea's media industry. It was a deeply meaningful opportunity to engage in substantive discussions with academic colleagues and industry practitioners.</p><p>I'd like to share the key findings and implications from my presentations.</p><h2>1. Sustainable Media Ecosystem Financing (KOBACO Session)</h2><img src='/images/blog/conf2.jpg' alt='KOBACO session presentation' style='width:100%; margin:2rem 0; border-radius:0.5rem;' /><p>In the KOBACO session, I presented on \"Restructuring Government Financing for a Sustainable Media Ecosystem.\" Despite nominal revenue growth of 18.9% over the past decade, Korea's media industry faces a stark reality: real revenue inflow has stagnated at just 0.1%—a classic case of \"nominal growth illusion.\"</p><img src='/images/blog/conf3.jpg' alt='KOBACO session discussion' style='width:100%; margin:2rem 0; border-radius:0.5rem;' /><p>The structural collapse of broadcast advertising revenue (-43.5%) and the 44-year freeze on public broadcasting license fees have depleted the industry's capacity for reinvestment. My presentation highlighted how these policy failures have intensified the industry crisis and proposed a concrete policy roadmap including:</p><ul><li>Normalizing KBS license fees</li><li>Immediate deregulation of broadcast advertising restrictions</li><li>Easing platform operators' contributions to the Broadcasting Development Fund</li></ul><img src='/images/blog/conf4.jpg' alt='KOBACO session Q&A' style='width:100%; margin:2rem 0; border-radius:0.5rem;' /><p>The Q&A session was particularly engaging, with insightful questions from KOBACO representatives and industry stakeholders about implementation strategies and regulatory challenges.</p><h2>2. Korea-US OTT Switching Behavior Analysis</h2><p>Second, I shared research on \"Analyzing OTT Switching Behavior Across Korea-US Markets\" (co-authored with Daekyu Kim). To understand the mechanisms driving consumer migration from pay-TV to OTT, we applied the Push-Pull-Mooring framework combined with four methodologies: SEM, NCA, fsQCA, and Causal ML.</p><p>A key finding: \"pull\" factors (attractiveness of alternative OTT services) are 4.35 times more powerful than \"push\" factors (dissatisfaction with existing services) in driving switching intentions. Notably, unlike the US market's high-cost structure, Korea's entrenched ultra-low-cost pay-TV pricing means that cost (push) is not a driver—instead, content attractiveness (pull) emerges as the sole and critical determinant of switching behavior.</p><h2>3. Digital Inequality of Time: Quality Gaps in Usage</h2><p>Finally, through my research on \"Digital Inequality of Time,\" I examined the underside of digital transformation. Analyzing longitudinal data from the Korea Media Panel (2019-2024), I found that while first-generation digital divides (device access) have essentially been resolved across income strata, stark differences persist in \"quality of use\" (third-generation divide).</p><p>Lower-income groups spend more total time on media (a \"time paradox\"), but dedicate 88% of that time to entertainment. In contrast, higher-income groups allocate 35% of their media time to \"productive activities\" such as news consumption, information search, and learning. This qualitative gap in time usage (productivity index: 5.3% vs 34.5%) translates into differences in human capital accumulation, ultimately operating as a new mechanism of social stratification.</p><h2>Dialogue and Future Directions</h2><p>The sessions across all three topics were particularly engaging. Sharp questions from academics and industry professionals led to in-depth discussions on media financing challenges, competitive market dynamics, and digital inclusion.</p><p>This conference reaffirmed the complex, multifaceted challenges confronting the media environment and deepened my sense of responsibility as a researcher. I remain committed to providing practical policy alternatives for our rapidly evolving media landscape through evidence-based empirical research.</p><p>My gratitude to the KABTS organizing committee and all participants for making this such a productive and thought-provoking event. I look forward to continuing these important conversations.</p>"
    },
    {
      "slug": "starting-this-blog",
      "title": "Starting This Blog",
      "excerpt": "Welcome to my blog. I'm excited to share my thoughts on media policy, technology, and research.",
      "date": "2025-11-08",
      "category": "Announcement",
      "tags": ["Introduction", "Blog"],
      "author": "Yonghee Kim",
      "enableShare": false,
      "content": "<p>Hello! I'm excited to start this blog as a new space to share my thoughts and insights.</p><h2>Why This Blog?</h2><p>As a researcher and educator in media policy and management, I've always believed in the importance of sharing knowledge and fostering dialogue. This blog will serve as a platform where I can:</p><ul><li>Share insights from my research on media policy, OTT platforms, and digital regulation</li><li>Discuss current trends in media and technology</li><li>Reflect on my teaching and research experiences</li><li>Engage with broader questions about the future of media</li></ul><h2>What to Expect</h2><p>I'll be writing about topics that intersect media, policy, and technology. Some posts will be more academic, while others will be more reflective or commentary-driven. I hope this becomes a space for meaningful exchange of ideas.</p><p>Thank you for visiting, and I look forward to sharing this journey with you.</p>"
    }
  ]
}
